폼을 열면 다음 문단을 실행한다
{
        아이디입력란은 ""을 참조한다.
        비밀번호입력란은 ""을 참조한다.

 //       아이디입력란은 공유정보의 "ID"를 참조한다.
 //       비밀번호입력란은 공유정보의 "PW"를 참조한다.
}

로그인버튼을 누르면 다음 문단을 실행한다.
{
        아이디입력란의 자릿수가 0이면 "아이디를 입력하세요"를 화면에 표시하고 문단의 실행을 취소한다.
        비밀번호입력란의 자릿수가 0이면 "비밀번호를 입력하세요"를 화면에 표시하고 문단의 실행을 취소한다.

        DB처리문("로그인")을 실행한다.
        로그인배열값은 조회결과를 참조한다
        사원코드는 로그인배열값(1,1)을 참조한다
        상태1은 로그인배열값(1,1)을 참조한다
        상태2는 로그인배열값(1,2)를 참조한다

   

        전역정보의 "상태1"을 상태1로 설정한다.
        전역정보의 "상태2"를 상태2로 설정한다.
        전역정보의 "사원코드"를 사원코드로 설정한다.

        
        //DB는 데이터베이스("SHTECH_DB_PDA")를 참조한다.        
        //질의문은 식(" exec SP_PDA_LOGIN '"+아이디입력란+"','"+비밀번호입력란+"'")을 참조한다.
        //배열값은 ""이다
        //DB의 질의실행(질의문, 배열값)을 실행한다.
        //배열값의 행수가 0이면 "로그인 실패"를 화면에 표시하고 문단의 실행을 취소한다.
        //조건(배열값(1, "ERRO_NAME") = "ERRO_NAME")이면 조건(배열값(1, "ERRO_DETL"))을 화면에 표시하고 문단의 실행을 취소한다.

//        사원코드는 배열값(1,3)을 참조한다.
        
        공유정보의 "ID"를 아이디입력란으로 설정한다.
        공유정보의 "PW"를 비밀번호입력란으로 설정한다.
        공유정보의 "사원코드"는 아이디입력란으로 설정한다.
        상태2가 "1"이 아니면 다음 문단을 실행한다
        {
                상태2를 화면에 표시한다
                문단의 실행을 취소한다
        }
        상태2가 "1"이면 다음 문단을 실행한다
        {

        DB는 데이터베이스("SHTECH_DB_PDA")를 참조한다
        질의문은 식("select top 1 USER_NAME as NM from BE_USER_INFO where USER_CODE = '"+상태1+"'")을 참조한다
        사원배열값은 ""이다
        DB의 질의실행(질의문, 사원배열값)을 실행한다
        사원배열값의 행수가 0이면 "사용자 정보를 찾을 수 없습니다."를 화면에 표시하고 문단의 실행을 취소한다.
        전역정보의 "사원명"을 사원배열값(1,"NM")으로 설정한다
        사원명은 전역정보의 "사원명"이다








        메뉴버튼의 상세폼보기를 실행한다.       





        }
}



        


종료버튼을 누르면 다음 문단을 실행한다
{
        "프로그램을 종료 하시겠습니까?"를 화면에 표시한다('예아니오','질문',"프로그램종료","예처리","아니오처리")
}
문단 예처리
{
        앱을 종료한다
}
문단 아니오처리
{
        문단의 실행을 취소한다.
}















